Revit 2027 API
InitialIlluminanceIntensity(Double, Double) Constructor
 Creates an initial illuminance intensity object with the given document and illuminance values.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public InitialIlluminanceIntensity(
	double distance,
	double illuminance
)
Public Sub New (
	distance As Double,
	illuminance As Double
)
public:
InitialIlluminanceIntensity(
	double distance,
	double illuminance
)
new :
        distance : float *
        illuminance : float -> InitialIlluminanceIntensity
Parameters
distance Double
 The illuminance distance value in feet as a numerical value between 0 and 1e+30.
illuminance Double
 The illuminance value in lx as a numerical value between 0 and 1e+30.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The distance value is not valid because it is not between 0 and 1e+30. -or- The illuminance value is not valid because it is not between 0 and 1e+30.
See Also
Reference
InitialIlluminanceIntensity Class
InitialIlluminanceIntensity Overload
Autodesk.Revit.DB.Lighting Namespace